#ifndef MATRIX_H
#define MATRIX_H

//include定義
#include "Common.h"

//Define定義


class Matrix
{

public:
	//コンストラクタ
	Matrix();

	//デストラクタ
	~Matrix();

	/*-------------------------------------------------------------------------------
	*	関数説明
	*	　単位行列を生成する
	*	引数
	*	　なし
	*	戻り値
	*	　なし
	*-------------------------------------------------------------------------------*/
	void Identity();

	/*-------------------------------------------------------------------------------
	*	関数説明
	*	　移動行列を適応する
	*	引数
	*	　p_x	：[I/ ]　X 方向の移動量
	*	　p_y	：[I/ ]　Y 方向の移動量
	*	　p_z	：[I/ ]　Z 方向の移動量
	*	戻り値
	*	　なし
	*-------------------------------------------------------------------------------*/
	void Translate(const GLfloat p_x, const GLfloat p_y, const GLfloat p_z);

	/*-------------------------------------------------------------------------------
	*	関数説明
	*	　行列の値を取得する
	*	引数
	*	　なし
	*	戻り値
	*	　行列の値
	*-------------------------------------------------------------------------------*/
	const GLfloat* GetMatrix();

private:

	//行列用の配列
	//
	//[ 0][ 1][ 2][ 3]
	//[ 4][ 5][ 6][ 7]
	//[ 8][ 9][10][11]
	//[12][13][14][15]
	//
	GLfloat m_val[16];
};
#endif